function Data01() {
Acordion("Райга Куросуки","1");
Text01('[E002]',
 'BTNRaiga.blp','medium',
 'Райга Куросуки','Гром Скрытого Тумана', '0,0',
 '295',
 '600 (дальний бoй)',
 'Райрюю но Тацумаки |nУдар Молнии |nРанмару |n|cff99ccffКлыки Молнии',
 'Мастер, Инициатор, Поддержка',
 ''+str+' - 21 + 2.3'+agiA+' - 22 + 2.0'+int+' - 19 +1.8',
);
document.write('</div></div></div>');
Acordion("Хьюго Ханаби","2");
Text01('[E00P]',
 'BTNHanabi.blp','medium',
 'Хьюго Ханаби','Младшая Сестра Хинаты', '0,0',
 '290',
 '128 (ближний бoй)',
 'Хакке Кухекишо Дзюкен |nХакке Кушо |nХаккещоо Кайтэн |n|cff99ccffДвойной Кулак Тигра',
 'Поддержка, Контроль и Мастер',
 ''+str+' - 24 + 2.3'+agi+' - 10 +1.2'+intA+' - 28 + 2.8',
);
document.write('</div></div></div>');
Acordion("Гурэн","3");
Text01('[H0DO]',
 'BTNGuren.blp','medium',
 'Гурэн','Куноичи из Деревни Скрытого Звука', '1,0',
 '300',
 '600 (дальний бoй)',
 'Шотон: Хашо Корью |nШотон: Суйшо Ро но Дзюцу |nШотон: Буншин но Дзюцу |n|cff99ccffШотон: Омиватари но Дзюцу',
 'Поддержка, Контроль и Мастер',
 ''+str+' - 19 + 1.5'+agi+' - 18 + 0.8'+intA+' - 27 + 3.6',
);
document.write('</div></div></div>');
Acordion("Учиха Обито","4");
Text01('[E02K]',
 'BTNObitoRikudo.blp','medium',
 'Учиха Обито','Джинчурики Джуби', '0,0',
 '325',
 '128 (ближний бoй)',
 'Волна Хвостатого Зверя |nМеч Нунобоко |nСкачок |n|cff99ccffСила Мудреца',
 'Бог, Инициатор и Мастер',
 ''+strA+' - 26 + 2.6'+agi+' - 18 + 1.7'+int+' - 20 + 2.2',
);
document.write('</div></div></div>');
document.write('</div></div></div>');
Acordion("Неджи Хьюга","5");
Text01('[H001]',
 'BTNNeji.blp','medium',
 'Неджи Хьюга','Гений Хьюго', '1,0',
 '295',
 '128 (ближний бoй)',
 'Хакке Хасангеки |nХакке Кушо |nХаккещоо Кайтэн  |n|cff99ccffШестьдесят Четыре Ладони',
 'Инициатор, Мастер, Контроль',
 ''+strA+' - 23 + 2.7'+agi+' - 21 + 2.0'+int+' - 14 + 1.3',
);
document.write('</div></div></div>');
Acordion("Бьякуя Кучики","6");
Text01('[E01Y]',
 'BTNByakuya.blp','medium',
 'Бьякуя Кучики','Капитан Шестого Отряда', '0,0',
 '305',
 '600 (дальний бoй)',
 'Сенбонзакура  |nБакудо #61 |nШунпо  |n|cff99ccffБанкай',
 'Мастер, Инициатор, Контроль',
 ''+str+' - 18 + 2.1'+agiA+' - 23 + 2.7'+int+' - 20 + 2.0',
);
document.write('</div></div></div>');
Acordion("Хиори Саругаки","7");
Text01('[E01A]',
 'BTNHiori.blp','medium',
 'Хиори Саругаки','Вайзард', '0,0',
 '305',
 '128 (ближний бoй)',
 'Серо  |nРейрёку |nСонидо  |n|cff99ccffМаска Пустого',
 'Поддержка, Контроль, Мастер',
 ''+str+' - 16 + 1.8'+agi+' - 13 + 1.4'+intA+' - 24 + 2.9',
);
document.write('</div></div></div>');
Acordion("Нойтра Джилга","8");
Text01('[O00J]',
 'BTNNoitoraB.blp','medium',
 'Нойтра Джилга','Эспада №5', '0,0',
 '290',
 '128 (ближний бoй)',
 'Серо  |nСильный Удар |nИерро  |n|cff99ccffСанта Тереза',
 'Поддержка, Контроль, Мастер',
 ''+strA+' - 29 + 2.4'+agi+' - 17 + 1.7'+int+' - 14 + 1.8',
);
document.write('</div></div></div>');
Acordion("Кагуя","9");
Text01('[E02I]',
 'BTNKaguya.blp','medium',
 'Кагуя','Принцесса Ооцуцуки', '1,0',
 '305',
 '128 (ближний бoй)',
 'Томогороши Но Хайкоцу |nШесть Стихий Чакры |nПортал |n|cff99ccffИзмерение Кагуи',
 'Инициатор, Бог, Мастер',
 ''+strA+' - 23 + 2.3'+agi+' - 23 + 2.1'+int+' - 18 + 1.7',
);
document.write('</div></div></div>');
}